/*
    Цей код використовує import.meta.url, щоб отримати URL поточного файлу,
    конвертує його в шлях до файлу за допомогою fileURLToPath
    та повертає шлях до директорії цього файлу за допомогою dirname.
    Цей шлях може використовуватись для звернення до файлів, 
    що знаходяться в поточній директорії.
*/

// Імпортуємо необхідні модулі
import { dirname } from 'path';
import { fileURLToPath } from 'url';

// Експортуємо шлях до поточної директорії файлу
export default dirname(fileURLToPath(import.meta.url));